"use strict";
window.fineList = {
    searchFines : searchFines
}

//Ця зміна містить всі дані які в нас зберігаються у файлі data
let DB = data.finesData;

    /*
     Напишіть свій код тут!
     Як ви бачите функція повертає статичні дані.
     Замість масиву який прописаний хардкодом, вам необхідно реалізувати цю функцію
     так, щоб вона повертала масив відповідно переданому значенню в функцію.
     Саме значення - це "Пошук за номером" або "Пошук за типом штрафу"
     Тип штрафу може бути тільки
     - Перевищення швидкості
     - Невірне паркування
     - Їзда у не тверезому стані
     */

    function searchFines(searchKey) {
        let results = []
        results = DB.filter(fine => fine.номер === searchKey || fine.тип === searchKey);
        return results
    }

    // можна дописати логіку, якщо юзер залишив поля пустими і клікає на кнопку [Пошук штрафів], ми повертаємо весь масив 
